// 9. Вывести на экран четные числа от 1 до N
int N=Convert.ToInt32(Console.ReadLine());
int i=1;
while(i<=N)
{
    System.Console.WriteLine($"{i} ");
    i=i+1;
}