// 10. Вывести на экран последнюю цифру целого числа введенного с клавиатуры. 
int a=568;
System.Console.WriteLine(a/1%10);